#language: ru

Функционал: Проверка основной функциональности обработки

Как Программист
Я хочу запустить обработку редактор 1С
Чтобы проверить основную функциональнось обработку 

Контекст: 
	И я подключаю профиль TestClient "Тест_редактора"  
	И я закрываю все окна клиентского приложения
	
Сценарий: Запускт внешней обработки
	И я выбираю файл "G:\Git_repositorys\1C_editor\bin\doc_editor_1C.epf" ВК
	Когда открылось окно 'Редактор документов в 1С'
	И в таблице "СтруктураМетаданных" я нажимаю на кнопку с именем 'ВывестиСтруктуруМетаданных'
	И в таблице "СтруктураМетаданных" я разворачиваю строку:
		| 'Имя объекта' | 'Индекс картинки' | 'Класс'      | 'Менеджер объектов' | 'Менеджер подчиненных элементов' | 'Новый' | 'Синоним'     | 'Табличная часть' |
		| 'Справочники' | '33'              | 'Справочник' | 'Да'                | 'Нет'                            | 'Нет'   | 'Справочники' | 'Нет'             |
	И в таблице "СтруктураМетаданных" я перехожу к строке:
		| 'Имя объекта'     | 'Индекс картинки' | 'Класс'      | 'Менеджер объектов' | 'Менеджер подчиненных элементов' | 'Новый' | 'Полное имя'                 | 'Синоним'         | 'Табличная часть' | 'Тип'                              |
		| 'тест_Справочник' | '33'              | 'Справочник' | 'Нет'               | 'Нет'                            | 'Нет'   | 'Справочник.тест_Справочник' | 'Тест справочник' | 'Нет'             | 'СправочникСсылка.тест_Справочник' |
	И в таблице "СтруктураМетаданных" я активизирую поле с именем "СтруктураМетаданныхНовый"
	И в таблице "СтруктураМетаданных" я активизирую поле с именем "СтруктураМетаданныхИмя"
	И я выбираю пункт контекстного меню с именем 'ПоказатьСвойстваОбъекта' на элементе формы с именем "СтруктураМетаданных"
			
* Добавление описания объекта
	И я выбираю пункт контекстного меню с именем 'ДобавитьОписаниеОбъекта' на элементе формы с именем "СтруктураМетаданных"
	Тогда элемент формы с именем "РедакторТекстовогоДокумента" стал равен 
		|'##### Доработать Справочник.тест_Справочник'|
		|''|
		|'**Реквизиты:**'|
		|''|
		|'Имя \| Тип \| Описание'|
		|'---------\|----------\|---------'|
		|'Реквизит \| Строка \| Этот реквизит предназначен для вывода информации на экран формы'|
		|'Пользователь \| СправочникСсылка.Пользователи \| Здесь указывается пользователь которому доступен справочник'|
		|''|
		|'**Табличная часть:** ТабличнаяЧасть'|
		|''|
		|'Имя \| Тип \| Описание'|
		|'---------\|----------\|---------'|
		|'РеквизитТабЧасти \| Строка \| Этот реквизит нужен для того чтобы он был'|
		
	И я выполняю код встроенного языка (Расширение)
	"""bsl
	Сообщить("Hello world.")
	"""
		