
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ДанныеМодуляОбъекта") Тогда
		ПоказатьМодульОбъекта(Параметры.ДанныеМодуляОбъекта);
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ПоказатьМодульОбъекта(ДанныеМодуляОбъекта)
	
	ТекстПрограммногоМодуля = ДанныеМодуляОбъекта.МодульОбъект.ТекстМодуля;
	ЗаполнитьСхемуПрограммногоМодуля(ДанныеМодуляОбъекта.КонтекстМодуля);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСхемуПрограммногоМодуля(КонтекстМодуля)
	
	ОбластьМодуля = Неопределено;
	Для Каждого БлокМодуля Из КонтекстМодуля Цикл
		Если БлокМодуля.ТипБлока = "НачалоОбласти" Тогда
			ОбластьМодуля = ОбластьОбластьПрограммногоМодуля(БлокМодуля, ОбластьМодуля);
		ИначеЕсли БлокМОдуля.ТипБлока = "ЗаголовокМетода" Тогда
			ДобавитьМетодОбъектаВСхему(ОбластьМодуля, БлокМодуля);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьМетодОбъектаВСхему(ОбластьМодуля, БлокМодуля)
	
	Если Не ОбластьМодуля = Неопределено Тогда
		МетодОбъекта = ОбластьМодуля.ПолучитьЭлементы().Добавить();		
	Иначе
		МетодОбъекта = СхемаМодуля.ПолучитьЭлементы().Добавить();
	КонецЕсли;
	
	МетодОбъекта.ТипМетода = БлокМодуля.ОписаниеБлока.ТипМетода;
	МетодОбъекта.ПредставлениеБлока = БлокМодуля.ОписаниеБлока.ИмяМетода;
	МетодОбъекта.НомерСтрокиМетода = БлокМодуля.НачальнаяСтрока;
		
КонецПроцедуры

&НаСервере
Функция ОбластьОбластьПрограммногоМодуля(БлокМодуля, ОбластьМодуляРодитель)

	Если Не ОбластьМодуляРодитель = Неопределено Тогда
		ОбластьМодуля = ОбластьМодуляРодитель.ПолучитьЭлементы().Добавить();		
	Иначе
		ОбластьМодуля = СхемаМодуля.ПолучитьЭлементы().Добавить();
	КонецЕсли;
	
	ОбластьМодуля.ПредставлениеБлока = "#Область " + БлокМодуля.ОписаниеБлока.ИмяОбласти;
	ОбластьМодуля.НомерСтрокиМетода = БлокМодуля.НачальнаяСтрока;
	
	Возврат ОбластьМодуля;
	
КонецФункции

&НаКлиенте
Процедура СхемаМодуляПриАктивизацииСтроки(Элемент)

	Элементы.ПрограммныйМодуль.УстановитьГраницыВыделения(
		Элементы.СхемаМодуля.ТекущиеДанные.НомерСтрокиМетода, 1, 
		Элементы.СхемаМодуля.ТекущиеДанные.НомерСтрокиМетода, 1);

КонецПроцедуры


